app/views/posts/user_posts.html.erb


<% @user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]