app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("comment_entry", "created_at", "updated_at", "post_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment_entry", "dcsdc"], ["created_at", "2018-02-13 13:07:33.869586"], ["updated_at", "2018-02-13 13:07:33.869586"], ["post_id", 2], ["user_id", 3]]