app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "user_posts"], ["LIMIT", 1]]
---
  def user_posts
    @user = User.find_by(username: params[:name])

SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.all.page(params[:page])

INSERT INTO "posts" ("title", "blog_entry", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "gcgc"], ["blog_entry", "vhvh"], ["created_at", "2018-02-13 12:48:27.086253"], ["updated_at", "2018-02-13 12:48:27.086253"], ["user_id", 3]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "hhg, hbjuv"], ["updated_at", "2018-02-14 02:06:30.706506"], ["id", 12]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)